## 1. pandas 패키지 로드

pands: 데이터분석을 위한 패키지

In [3]:
import pandas as pd

## 2. pandas 의 Series 와 DataFrame

1차원, 1개의 column은 Series  
dataframe에는 여러 series가 있음

### 2-1. Series
1차원으로 이루어진 데이터 배열

In [5]:
pd.Series([1,2,3,4]) #list를 넣어주면 됨

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
a = [1, 2, 3, 4]

In [7]:
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

### 2-2. DataFrame

2차원으로 이루어진 데이터 배열

#### 방법 1. list로 만들기

In [8]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 1000, '자동차'],
           ['네이버', 500, '포털']]

In [9]:
pd.DataFrame(company1)

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [10]:
df1 = pd.DataFrame(company1) #활용을 위해 변수에 담아주기

In [11]:
df1

     0     1     2
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### 제목컬럼 만들기

In [12]:
df1.columns = ['기업명', '매출액', '업종']

In [13]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### 방법 2. dict로 만들기
key, value로

In [15]:
company2 = {'기업명':['삼성', '현대', '네이버'], 
            '매출액': [2000, 1000, 500], 
            '업종': ['스마트폰', '자동차', '포털']
           }

In [17]:
df2 = pd.DataFrame(company2)

In [18]:
df2

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

#### index를 특정 column으로 지정하기

In [19]:
df1

   기업명   매출액    업종
0   삼성  2000  스마트폰
1   현대  1000   자동차
2  네이버   500    포털

In [20]:
df1.index = df1['기업명']

In [21]:
df1

     기업명   매출액    업종
기업명
삼성    삼성  2000  스마트폰
현대    현대  1000   자동차
네이버  네이버   500    포털

#### series = column 이라고 했음

In [22]:
df1['매출액']

기업명
삼성     2000
현대     1000
네이버     500
Name: 매출액, dtype: int64

In [23]:
type(df1['매출액'])

pandas.core.series.Series